IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_TX1_CONTROLSS_FSI0_TX1.xml
<module name="CONTROLSS_FSI0_TX1_CONTROLSS_FSI0_TX1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_FSI0_TX1_TX_MASTER_CTRL" acronym="CONTROLSS_FSI0_TX1_TX_MASTER_CTRL" offset="0x0" width="16" description="">
		<bitfield id="KEY" width="8" begin="15" end="8" resetval="0x0" description="Write Key In order to write to any bit in this register, 0xA5 must be written to this field at the same time. Otherwise, writes are ignored. The key is cleared immediately after writing, so it must be written again for every change to this register." range="15 - 8" rwaccess="WO"/> 
		<bitfield id="FLUSH" width="1" begin="1" end="1" resetval="0x0" description="Flush Operation Start bit This bit will cause the transmitter to initiate a flush pattern of a single toggle on the TXD0 and TXD1 followed by five full cycles of TXCLK. This bit should be written only when the CORE_RST bit is 0 and the clock to the Transmitter core is turned on.   0h (R/W) = Clear this bit. 1h (R/W) = Setting this bit will Initiate flush sequence.  To properly execute a flush sequence, Set FLUSH to 1, wait for five TXCLK cycles then clear FLUSH to 0.  Note: The KEY field must contain 0xA5 for any write to this bit to take effect. The software must keep this bit set to 1 for at least five TXCLK cycles before setting it back to 0." range="1" rwaccess="RW"/> 
		<bitfield id="CORE_RST" width="1" begin="0" end="0" resetval="0x0" description="Transmitter Master Core Reset bit This bit controls the transmitter master core reset. In order to send any frame, this bit must be cleared.  0h (R/W) = Transmitter core is not in reset and can transmit frames. 1h (R/W) = Transmitter core is held in reset.   Note: The KEY field must contatin 0xA5 for any write to this bit to take effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_CLK_CTRL" acronym="CONTROLSS_FSI0_TX1_TX_CLK_CTRL" offset="0x4" width="16" description="">
		<bitfield id="PRESCALE_VAL" width="8" begin="9" end="2" resetval="0x0" description="Clock Divider Prescale Value The input clock is divided by this 8-bit value and fed into the transmitter core. This divided clock is the rate at which TXCLK will operate.  0h (R/W) = Reserved 1h (R/W) = Input clock /1 2h (R/W) = Input clock /2 3h (R/W) = Input clock /3 4h (R/W) = Input clock /4 ... FFh (R/W) = Input clock /255  TXCLKIN = Input clock / PRESCALE_VAL In FSI mode: TXCLK = TXCLKIN / 2 In SPI mode: TXCLK = TXCLKIN" range="9 - 2" rwaccess="RW"/> 
		<bitfield id="CLK_EN" width="1" begin="1" end="1" resetval="0x0" description="Clock Divider Enable bit This bit will enable and disable the input clock divider and start the clock to the transmitter core.  0h (R/W) = The input clock divider is not enabled and the clock is not connected to the transmitter core. 1h (R/W) = The input clock to the transmitter core is being divided by the PRESCALE_VAL and enabled." range="1" rwaccess="RW"/> 
		<bitfield id="CLK_RST" width="1" begin="0" end="0" resetval="0x0" description="Clock Divider Reset bit This bit will reset the clock counter in the clock divider.   0h (R/W) = The clock divider is set based on the value in PRESCALE_VAL. The input clock will be divided by PRESCALE_VAL if CLK_EN is set. 1h (R/W) = The clock divider will be reset to 0 and will stay reset until software writes a 0 to this bit." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_OPER_CTRL_LO_ALT2_" acronym="CONTROLSS_FSI0_TX1_TX_OPER_CTRL_LO_ALT2_" offset="0x8" width="16" description="">
		<bitfield id="SEL_TDM_IN" width="1" begin="10" end="10" resetval="0x0" description="Input TDM port Select bit This bit selects the input port for the transmitter core between the TDM input pins or the RX module. When this bit is '0', the inputs selected for TDM are from the TDM input pins. When this bit is '1', then inputs selected for TDM are from the RX module." range="10" rwaccess="RW"/> 
		<bitfield id="TDM_ENABLE" width="1" begin="9" end="9" resetval="0x0" description="Transmit TDM Mode Enable bit. This bit enables the TDM Mode for multi-slave TDM operation.  0h (R/W) Transmit TDM Mode is not enabled. 1h (R/W) Transmit TDM Mode is enabled." range="9" rwaccess="RW"/> 
		<bitfield id="SEL_PLLCLK" width="1" begin="8" end="8" resetval="0x0" description="Input Clock Select bit This bit selects the input clock source for the transmitter core.  0h (R/W) = SYSCLK is the source of the transmitter clock into the clock prescaler. 1h (R/W) = PLLRAWCLK is the source of the transmitter core clock into the clock prescaler." range="8" rwaccess="RW"/> 
		<bitfield id="PING_TO_MODE" width="1" begin="7" end="7" resetval="0x0" description="Ping Counter Reset Mode Select bit This bit selects when the ping counter will reset.  0h (R/W) = The ping counter will reset and restart only on hardware initiated ping frames, when ping counter has timed out. 1h (R/W) = The ping counter will reset and restart on any software initiated frame as well as a ping counter timeout" range="7" rwaccess="RW"/> 
		<bitfield id="SW_CRC" width="1" begin="6" end="6" resetval="0x0" description="CRC Source Select bit This bit selects the source of the CRC value that is transmitted.   0h (R/W) = The transmitted CRC value is computed by hardware. 1h (R/W) = The transmitted CRC value is sourced from the value programmed in the TX_USER_CRC register." range="6" rwaccess="RW"/> 
		<bitfield id="START_MODE" width="3" begin="5" end="3" resetval="0x0" description="Transmission Start Mode Select bit These bits select the method by which a new frame transmission is started.  0h (R/W) = Only a software write to TX_FRAME_CTRL.START initiate a new transmission. 1h (R/W) = The configured external trigger will initiate a new transmission. 2h (R/W) = Either writing to TX_FRAME_CTRL.START or the TX_FRAME_TAG_UDATA register will initiate a new transmission.  All other combinations of bits are illegal and reserved for future use." range="5 - 3" rwaccess="RW"/> 
		<bitfield id="SPI_MODE" width="1" begin="2" end="2" resetval="0x0" description="SPI Mode Select bit This bit enables and disables SPI compatibility mode.  0h (R/W) = FSI is in normal mode of operation. 1h (R/W) = FSI is operating in SPI compatibility mode." range="2" rwaccess="RW"/> 
		<bitfield id="DATA_WIDTH" width="2" begin="1" end="0" resetval="0x0" description="Transmit Data Width Select bits These bits define the number of data lines used by the transmitter.  0h (R/W) = Data will be transmitted on one data line (TXD0) 1h (R/W) = Data will be transmitted on two data lines (TXD0 and TXD1). The format of the data is described in the preceeding chapter. 2h, 3h (R/W) = Reserved" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_OPER_CTRL_HI_ALT1_" acronym="CONTROLSS_FSI0_TX1_TX_OPER_CTRL_HI_ALT1_" offset="0xA" width="16" description="">
		<bitfield id="EXT_TRIG_SEL" width="6" begin="12" end="7" resetval="0x0" description="External Trigger Select bit These bits define which of the 64 external inputs will be used as the source for the external input trigger.  00h (R/W) = Trigger 1 is the source. 01h (R/W) = Trigger 2 is the source. 02h (R/W) = Trigger 3 is the source. ... 3Fh (R/W) = Trigger 64 is the source." range="12 - 7" rwaccess="RW"/> 
		<bitfield id="ECC_SEL" width="1" begin="6" end="6" resetval="0x0" description="ECC Data Width Select bit This bit selects between 16-bit and 32-bit ECC computation.   0h (R/W) = 32-bit ECC is used. 1h (R/W) = 16-bit ECC is used." range="6" rwaccess="RW"/> 
		<bitfield id="FORCE_ERR" width="1" begin="5" end="5" resetval="0x0" description="Error Frame Force bit This bit will force the the CRC value of the transmitted data frame to 0 whenever there is a buffer overrun or underrun condition. This can be used to force a corrupted CRC as the data is not guaranteed to be reliable. The receiver will treat the data as invalid and can handle this as needed. Note: DO NOT use FORCE_ERR if using the SW CRC mode (FSI Transmit).  0h (R/W) = The CRC will not be forced to 0. 1h (R/W) = The CRC will be forced to 0 in a buffer overrun or underrun condition." range="5" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_FRAME_CTRL" acronym="CONTROLSS_FSI0_TX1_TX_FRAME_CTRL" offset="0xC" width="16" description="">
		<bitfield id="START" width="1" begin="15" end="15" resetval="0x0" description="Start Transmission bit This bit will cause the FSI to start transmitting the next frame.  0h (R/W) = Writing a 0 to this bit will have no effect. 1h (R/W) = Start the next transmission. This bit will be cleared by hardware." range="15" rwaccess="RW"/> 
		<bitfield id="N_WORDS" width="4" begin="7" end="4" resetval="0x0" description="Number of Words to be Transmitted This field defines the number of words which will be transmitted in a DATA_N_WORD frame. This is a user-defined field that must match the corresponding field in the receiver. Set this bitfield to be one less than the number of words to be transmitted.  0h (R/W) = 1 data word frame (16-bit data). 1h (R/W) = 2 data word frame (32-bit data). .. Fh (R/W) = 16 data word frame (256-bit data)." range="7 - 4" rwaccess="RW"/> 
		<bitfield id="FRAME_TYPE" width="4" begin="3" end="0" resetval="0x0" description="Transmit Frame Type This field determines the type of frame that will be transmitted next.  0000b (R/W) = Ping Frame. This frame can be sent either by software or automatically by hardware. 0100b (R/W) = DATA_1_WORD Frame. One word data frame (16-bit data). 0101b (R/W) = DATA_2_WORD Frame. Two word data frame (32-bit data). 0110b (R/W) = DATA_4_WORD Frame. Four word data frame (64-bit data).  0111b (R/W) = DATA_6_WORD Frame. Six word data frame (96-bit data). 0011b (R/W) = DATA_N_WORD Frame. The N_WORDS field will determine the number of words (1 to 16) to be sent. Both the transmitter and receiver must have the same value programmed. 1111b (R/W) = Error Frame. This frame can be used during error conditions or any condition where the transmitter wants to notify the receiver of a high priorty status. However, the user software is at liberty to use this for any purpose.  0001b, 0010b, and 1000b through 1110b are Reserved and should not be used." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_FRAME_TAG_UDATA" acronym="CONTROLSS_FSI0_TX1_TX_FRAME_TAG_UDATA" offset="0xE" width="16" description="">
		<bitfield id="USER_DATA" width="8" begin="15" end="8" resetval="0x0" description="User Data bits This is a user-defined value that will be loaded into the the user data phase of the frame. This 8-bit value can be used by the receiver for any application need. This value will not impact any hardware behavior." range="15 - 8" rwaccess="RW"/> 
		<bitfield id="FRAME_TAG" width="4" begin="3" end="0" resetval="0x0" description="This will be used only for software initiated transmissions. Frame tag bits This is a user-defined value that will be loaded into the frame tag phase of the next transmission. The receiver may use the frame tag for any application need. This value will not impact any hardware behavior  For external triggers do not use this register. Use the TX_PING_TAG register instead." range="3 - 0" rwaccess="RW"/>
	</register>
