IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_FSI0_TX1_CONTROLSS_FSI0_TX1.xml
	<register id="CONTROLSS_FSI0_TX1_TX_ECC_DATA" acronym="CONTROLSS_FSI0_TX1_TX_ECC_DATA" offset="0x40" width="32" description="">
		<bitfield id="DATA_HIGH" width="16" begin="31" end="16" resetval="0x0" description="Upper 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) the entire 32-bit register and update TX_ECC_VAL register with the results. Software should write to these 16 bits of the register in a 32-bit write when needing to compute ECC for 32-bits for the full TX_ECC_DATA register." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DATA_LOW" width="16" begin="15" end="0" resetval="0x0" description="Lower 16 bits of ECC Data Writing to this bitfield will cause the ECC logic to compute the ECC(SEC-DED) for these 16 bits and update the TX_ECC_VAL register with the results. Software should write to these register bits as a 16-bit write when needing to compute ECC for 16-bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_ECC_VAL" acronym="CONTROLSS_FSI0_TX1_TX_ECC_VAL" offset="0x44" width="16" description="">
		<bitfield id="ECC_VAL" width="7" begin="6" end="0" resetval="0x12" description="Computed ECC Value This field contains the ECC value computed using SEC-DED either for 16-bit or 32-bit data in the TX_ECC_DATA register." range="6 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_DLYLINE_CTRL" acronym="CONTROLSS_FSI0_TX1_TX_DLYLINE_CTRL" offset="0x48" width="16" description="">
		<bitfield id="TXD1_DLY" width="5" begin="14" end="10" resetval="0x0" description="Delay Line Tap Select for TXD1 This bitfield selects the number of delay elements inserted into the TXD1 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXD1 path. TXD1 is taken directly from the pin. 1h (R/W) One delay element is included in the TXD1 path. 2h (R/W) Two delay elements are included in the TXD1 path. ... 1Fh (R/W) 31 delay elements are included in the TXD1 path, the maximum." range="14 - 10" rwaccess="RW"/> 
		<bitfield id="TXD0_DLY" width="5" begin="9" end="5" resetval="0x0" description="Delay Line Tap Select for TXD0 This bitfield selects the number of delay elements inserted into the TXD0 path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXD0 path. TXD0 is taken directly from the pin. 1h (R/W) One delay element is included in the TXD0 path. 2h (R/W) Two delay elements are included in the TXD0 path. ... 1Fh (R/W) 31 delay elements are included in the TXD0 path, the maximum." range="9 - 5" rwaccess="RW"/> 
		<bitfield id="TXCLK_DLY" width="5" begin="4" end="0" resetval="0x0" description="Delay Line Tap Select for TXCLK This bitfield selects the number of delay elements inserted into the RXCLK path from the pin boundary to the receiver core.  0h (R/W) Zero delay elements are included in the TXCLK path. TXCLK is taken directly from the pin. 1h (R/W) One delay element is included in the TXCLK path. 2h (R/W) Two delay elements are included in the TXCLK path. ... 1Fh (R/W) 31 delay elements are included in the TXCLK path, the maximum." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_FSI0_TX1_TX_BUF_BASE" acronym="CONTROLSS_FSI0_TX1_TX_BUF_BASE" offset="0x80" width="16" description="">
		<bitfield id="BASE_ADDRESS" width="16" begin="15" end="0" resetval="0x0" description="Transmit Data Buffer Base Address This is the base address of the 16-word data buffer used by the transmitter." range="15 - 0" rwaccess="RW"/>
	</register>
</module>